test/bench/evidence/20260712-1946-fe0577d42/f_write_nj4-aster-r3.log
/nix/store/1l8z4baf9qnf1w3d5y903gyi6a0b64w4-initramfs
/nix/store/jnfjf689ijkaw2bdqnxil985940yrm96-initramfs-image
[Info] [normal] Forwarded QEMU guest port: 22436->22; 12955->8080 27057->6379 30536->5201 32662->31234 35880->31236 16598->11211
[Info] [test] Forwarded QEMU guest port: 21184->22; 42955->8080 45501->6379 58337->5201 21785->31234 55884->31236 55513->11211
warning: unstable feature specified for `-Ctarget-feature`: `ermsb`
  |
  = note: this feature is not stably supported; its behavior can change in the future

warning: `align_ext` (lib) generated 1 warning
warning: `ostd-test` (lib) generated 1 warning (1 duplicate)
warning: `linux-boot-params` (lib) generated 1 warning (1 duplicate)
warning: `typeflags-util` (lib) generated 1 warning (1 duplicate)
warning: `id-alloc` (lib) generated 1 warning (1 duplicate)
warning: `int-to-c-enum` (lib) generated 1 warning (1 duplicate)
warning: `aster-rights` (lib) generated 1 warning (1 duplicate)
warning: `ostd-pod` (lib) generated 1 warning (1 duplicate)
warning: `io-util` (lib) generated 1 warning (1 duplicate)
warning: `jhash` (lib) generated 1 warning (1 duplicate)
warning: `ostd` (lib) generated 1 warning (1 duplicate)
warning: `component` (lib) generated 1 warning (1 duplicate)
warning: `osdk-heap-allocator` (lib) generated 1 warning (1 duplicate)
warning: `aster-fuse` (lib) generated 1 warning (1 duplicate)
warning: `osdk-frame-allocator` (lib) generated 1 warning (1 duplicate)
warning: `xarray` (lib) generated 1 warning (1 duplicate)
warning: `ring-buffer` (lib) generated 1 warning (1 duplicate)
warning: `aster-util` (lib) generated 1 warning (1 duplicate)
warning: `aster-console` (lib) generated 1 warning (1 duplicate)
warning: `aster-input` (lib) generated 1 warning (1 duplicate)
warning: `aster-pci` (lib) generated 1 warning (1 duplicate)
warning: `aster-cmdline` (lib) generated 1 warning (1 duplicate)
warning: `cpio-decoder` (lib) generated 1 warning (1 duplicate)
warning: `keyable-arc` (lib) generated 1 warning (1 duplicate)
warning: `logo-ascii-art` (lib) generated 1 warning (1 duplicate)
warning: `device-id` (lib) generated 1 warning (1 duplicate)
warning: `aster-softirq` (lib) generated 1 warning (1 duplicate)
warning: `aster-systree` (lib) generated 1 warning (1 duplicate)
warning: `aster-i8042` (lib) generated 1 warning (1 duplicate)
warning: `aster-framebuffer` (lib) generated 1 warning (1 duplicate)
warning: `aster-time` (lib) generated 1 warning (1 duplicate)
warning: `aster-uart` (lib) generated 1 warning (1 duplicate)
warning: `aster-logger` (lib) generated 1 warning (1 duplicate)
warning: `aster-block` (lib) generated 1 warning (1 duplicate)
warning: `aster-bigtcp` (lib) generated 1 warning (1 duplicate)
warning: `aster-network` (lib) generated 1 warning (1 duplicate)
warning: `aster-nvme` (lib) generated 1 warning (1 duplicate)
warning: `aster-mlsdisk` (lib) generated 1 warning (1 duplicate)
warning: `aster-virtio` (lib) generated 1 warning (1 duplicate)
warning: `aster-kernel` (lib) generated 1 warning (1 duplicate)
warning: `aster-kernel-osdk-bin` (bin "aster-kernel-osdk-bin") generated 1 warning (1 duplicate)
    Finished `release` profile [optimized] target(s) in 0.43s
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=01h].ECX.pcid [bit 17]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.hle [bit 4]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.rtm [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512f [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512dq [bit 17]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512cd [bit 28]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512bw [bit 30]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512vl [bit 31]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi [bit 1]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi2 [bit 6]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vnni [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512bitalg [bit 12]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512-vpopcntdq [bit 14]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.la57 [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=80000008h].EBX.wbnoinvd [bit 9]
[=3h0000BdsDxe: loading Boot0002 "UEFI QEMU DVD-ROM QM00005 " from PciRoot(0x0)/Pci(0x1F,0x2)/Sata(0x2,0xFFFF,0x0)
BdsDxe: starting Boot0002 "UEFI QEMU DVD-ROM QM00005 " from PciRoot(0x0)/Pci(0x1F,0x2)/Sata(0x2,0xFFFF,0x0)
WARNING: no console will be available to OS
Spawn the first kernel thread
[kernel] unpacking initramfs.cpio.gz to rootfs ...
[kernel] rootfs is ready

                                  ......
                                .-++++=:
                               .=+++++=:
                              :+++++++=:
                            .-++++++++=.
                           .=**++==+++=.
                          :****+-.=+++=.
                        .=****+: .++++=.
                       .+****=.  .++++-
                     .-*****=.   :++++-
    .::-=============+*****+-----=++++=-:::::::.
        ..:-*#########*********+++++++=======:.
              .:+*#####****+++++++++++=====-..
                 ..-+#******=..  -++++.
                -+=...:*******=..=++++.
              .+*+++=. ..=*****+-=++++.
            .:***+=..     .-+**++++++=.
           .-***+:          .-+++++++=
          .*#*=.              .=+++++=
        .-*#+..                .:=+++-
       .=#=.                     .=++-
      :*=.                         ...
    .:-. Presented by the Asterinas developers
    .. Released under Mozilla Public License v2.0

Running benchmark: fio/ext4_p9_param on asterinas
The VM is ready for the benchmark.
P9CFG mode=write rw=write bs=1M nj=4 fsync=0 size=1G
P9CASE write
p9write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
...
fio-3.39
Starting 4 threads
p9write: Laying out IO file (1 file / 1024MiB)
Jobs: 4 (f=4)
p9write: (groupid=0, jobs=1): err= 0: pid=16: Sun Jul 12 19:58:42 2026
  write: IOPS=569, BW=570MiB/s (598MB/s)(1024MiB/1797msec); 0 zone resets
    clat (usec): min=52, max=5764, avg=381.73, stdev=971.10
     lat (usec): min=61, max=5799, avg=422.68, stdev=1008.37
    clat percentiles (usec):
     |  1.00th=[   53],  5.00th=[   54], 10.00th=[   55], 20.00th=[   56],
     | 30.00th=[   58], 40.00th=[   60], 50.00th=[   63], 60.00th=[   70],
     | 70.00th=[   83], 80.00th=[  102], 90.00th=[  310], 95.00th=[ 3294],
     | 99.00th=[ 4359], 99.50th=[ 4490], 99.90th=[ 4686], 99.95th=[ 5735],
     | 99.99th=[ 5735]
  lat (usec)   : 100=79.79%, 250=5.08%, 500=5.76%, 750=0.10%, 1000=0.10%
  lat (msec)   : 2=0.29%, 4=7.03%, 10=1.86%
  cpu          : usr=0.50%, sys=21.99%, ctx=0, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
p9write: (groupid=0, jobs=1): err= 0: pid=17: Sun Jul 12 19:58:42 2026
  write: IOPS=570, BW=570MiB/s (598MB/s)(1024MiB/1795msec); 0 zone resets
    clat (usec): min=52, max=897355, avg=1251.65, stdev=28047.37
     lat (usec): min=61, max=897366, avg=1296.50, stdev=28047.68
    clat percentiles (usec):
     |  1.00th=[    53],  5.00th=[    54], 10.00th=[    55], 20.00th=[    56],
     | 30.00th=[    58], 40.00th=[    61], 50.00th=[    64], 60.00th=[    70],
     | 70.00th=[    82], 80.00th=[   103], 90.00th=[   285], 95.00th=[  3261],
     | 99.00th=[  4359], 99.50th=[  4621], 99.90th=[  5211], 99.95th=[893387],
     | 99.99th=[893387]
   bw (  MiB/s): min= 1350, max= 1350, per=59.23%, avg=1350.13, stdev= 0.00, samples=1
   iops        : min= 1350, max= 1350, avg=1350.00, stdev= 0.00, samples=1
  lat (usec)   : 100=79.59%, 250=6.25%, 500=5.08%
  lat (msec)   : 2=0.29%, 4=7.03%, 10=1.66%, 1000=0.10%
  cpu          : usr=0.61%, sys=5.30%, ctx=0, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
p9write: (groupid=0, jobs=1): err= 0: pid=18: Sun Jul 12 19:58:42 2026
  write: IOPS=570, BW=571MiB/s (599MB/s)(1024MiB/1794msec); 0 zone resets
    clat (usec): min=52, max=898455, avg=1696.11, stdev=31453.69
     lat (usec): min=61, max=898465, avg=1733.31, stdev=31453.75
    clat percentiles (usec):
     |  1.00th=[    53],  5.00th=[    54], 10.00th=[    55], 20.00th=[    57],
     | 30.00th=[    59], 40.00th=[    62], 50.00th=[    65], 60.00th=[    72],
     | 70.00th=[    85], 80.00th=[   110], 90.00th=[   289], 95.00th=[  3294],
     | 99.00th=[  4359], 99.50th=[  4555], 99.90th=[455082], 99.95th=[901776],
     | 99.99th=[901776]
   bw (  MiB/s): min= 1349, max= 1349, per=59.20%, avg=1349.27, stdev= 0.00, samples=1
   iops        : min= 1349, max= 1349, avg=1349.00, stdev= 0.00, samples=1
  lat (usec)   : 100=78.03%, 250=8.11%, 500=4.69%
  lat (msec)   : 2=0.10%, 4=7.62%, 10=1.27%, 500=0.10%, 1000=0.10%
  cpu          : usr=0.61%, sys=5.35%, ctx=0, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
p9write: (groupid=0, jobs=1): err= 0: pid=19: Sun Jul 12 19:58:42 2026
  write: IOPS=571, BW=571MiB/s (599MB/s)(1024MiB/1792msec); 0 zone resets
    clat (usec): min=52, max=451132, avg=814.13, stdev=14118.52
     lat (usec): min=61, max=1347.3k, avg=1730.64, stdev=42101.58
    clat percentiles (usec):
     |  1.00th=[    53],  5.00th=[    54], 10.00th=[    55], 20.00th=[    56],
     | 30.00th=[    58], 40.00th=[    60], 50.00th=[    63], 60.00th=[    70],
     | 70.00th=[    86], 80.00th=[   113], 90.00th=[   297], 95.00th=[  3261],
     | 99.00th=[  4293], 99.50th=[  4555], 99.90th=[  5473], 99.95th=[450888],
     | 99.99th=[450888]
   bw (  MiB/s): min= 1359, max= 1359, per=59.64%, avg=1359.52, stdev= 0.00, samples=1
   iops        : min= 1359, max= 1359, avg=1359.00, stdev= 0.00, samples=1
  lat (usec)   : 100=77.54%, 250=8.59%, 500=4.69%
  lat (msec)   : 4=7.52%, 10=1.56%, 500=0.10%
  cpu          : usr=0.56%, sys=5.42%, ctx=0, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2279MiB/s (2390MB/s), 570MiB/s-571MiB/s (598MB/s-599MB/s), io=4096MiB (4295MB), run=1792-1797msec
P9DONE write
P9ALLDONE